_posts/2015-02-06-Improve-Android-Code-With-Lint.html
---
layout: post
title: Improve android code with lint
tag: [Android, Performance]
description: [The Android lint tool is a static code analysis tool 
that checks your Android project source files for potential bugs 
and optimization improvements for correctness. security. 
performance. usability. accessibility. and internationalization.]
---

<p>
Lint is under the <b>tool</b> folder of your sdk, If you are using 
Android Studio, you can also use <b>./gradlew :project:lint</b> to 
scan the project code.
</p>

<p>
If you are using gradlew, the lint result will in the 
<b>project/build/outputs/</b>, there are usually two files:
lint-result.html, lint-result.xml.
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Common lint issues</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">1. Useless xml files</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Sometimes you delete a customized view file, but forget to delete
the related xml code where use it.
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">2. InconsistentLayout: Inconsistent Layouts</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Contents of two same name files but different folders are different.
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">3. Calling new methods on older versions</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Your min sdk is A, but the funtions are only in higher sdks.
</p>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">4. Memory allocations within drawing code</h3>
<div class="outline-text-3" id="text-1-4">
<p>
You should avoid allocating objects during a drawing or layout operation. 
These are called frequently, so a smooth UI can be interrupted by garbage 
collection pauses caused by the object allocations.
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">5. Use sparseArray instead of hashmap.</h3>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">References</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="http://developer.android.com/tools/debugging/improving-w-lint.html">http://developer.android.com/tools/debugging/improving-w-lint.html</a>
</p>
</div>
</div>
